#include "ch05_struct.h"

int main() {
    ITEM data[10] = {

            {"201008101", "정소희", 87,  98, 56, 0, 0},
            {"201008102", "이아름", 67,  98, 65, 0, 0},
            {"201008103", "김동현", 23,  98, 75, 0, 0},
            {"201008104", "박진영", 11,  23, 67, 0, 0},
            {"201008105", "김소연", 23,  17, 78, 0, 0},
            {"201008106", "박희동", 67,  76, 15, 0, 0},
            {"201008107", "임달자", 89,  64, 35, 0, 0},
            {"201008108", "강창후", 100, 46, 67, 0, 0},
            {"201008109", "권동수", 25,  98, 56, 0, 0},
            {"201008110", "김창민", 87,  87, 56, 0, 0},
    };
    ITEM temp;
    for (int i = 0; i < 10; ++i) {
        data[i].score[3] = data[i].score[0]+data[i].score[1]+data[i].score[2];
        data[i].score[4] = data[i].score[3] /3;
    }

    for (int i = 0; i < 9; ++i) {
        for (int j = i+1; j < 10; ++j) {
            if (data[i].score[3] < data[j].score[3])
            {
                temp = data[i];
                data[i] = data[j];
                data[j] = temp;
            }
        }
    }

    cout << "********************************************************************" << endl;

    for (int i = 0; i < 10; ++i) {
        cout << data[i].st_num << "        ";
        cout << data[i].name << "        ";

        for (int j = 0; j < 5; ++j) {
            cout << setw(5) << data[i].score[j] << " ";
        }
        cout << endl;
    }
}